# Core
brew "git"
brew "gh"
brew "chezmoi"
brew "jq"
brew "yq"
brew "wget"
brew "age"

# Shell UX
brew "starship"
brew "antidote"
brew "fzf"
brew "zoxide"
brew "atuin"

# Modern Unix replacements
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "git-delta"
brew "dust"
brew "duf"
brew "hyperfine"
brew "tokei"

# Dev workflow
brew "tmux"
brew "sesh"
brew "tmuxp"
brew "lazygit"
brew "neovim"
brew "vim"
brew "mise"
brew "uv"
brew "direnv"
brew "go"
brew "rustup"

# Security / auth
{{ if and (eq .chezmoi.os "darwin") (not .headless) -}}
brew "mas"
{{- end }}
{{ if eq .password_manager "1password" -}}
brew "1password-cli"
{{- else if eq .password_manager "bitwarden" -}}
brew "bitwarden-cli"
{{- end }}

{{ if and (eq .chezmoi.os "darwin") (not .headless) -}}
# macOS desktop apps, fonts, browsers, launchers, and App Store apps
cask "gitup-app"            # GitUp: fast native GUI for visualizing git history
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
{{ if eq .password_manager "1password" -}}
cask "1password"
{{- else if eq .password_manager "bitwarden" -}}
cask "bitwarden"
{{- end }}
cask "karabiner-elements"
brew "defaultbrowser"
cask "google-chrome"          # ubiquitous baseline for web-compat/testing
cask "zen"                    # daily driver: Arc-like sidebar + vertical tabs (Gecko)
cask "zoom"
cask "slack"
cask "raycast"                # keyboard-first launcher; Quicklinks jump to daily links
mas "Anybox", id: 1593408455  # native bookmarks: menu-bar mode + Anydock profiles (paid; buy in App Store first)
cask "betterdisplay"          # display resolution presets, DDC brightness, layout protection, CLI/Shortcuts integration

# Docker. Desktop needs a PAID license for orgs >250 staff or >$10M revenue, so:
#   personal -> Docker Desktop (app + CLI + daemon); work -> Colima + CLI (free, no GUI).
{{ if .work -}}
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
{{- else -}}
cask "docker-desktop"
{{- end }}

{{ if not .work -}}
# Personal machines only: AI agents + editors + personal apps
cask "claude-code"           # Claude CLI
cask "codex"                 # Codex CLI
cask "codex-app"             # Codex desktop app (manage coding agents)
cask "chatgpt"               # OpenAI ChatGPT desktop app
cask "visual-studio-code"    # hosts the anthropic.claude-code extension (vscode-extensions.txt)
cask "cursor"
cask "opencode-desktop"      # OpenCode UI; the CLI is installed in 20-tools.sh
cask "zed"
cask "obsidian"
cask "ollama-app"            # local LLM runtime; serves localhost:11434 for Smart Connections embeddings + Whisper
cask "thebrowsercompany-dia" # Arc's successor (AI-first); needs macOS 14+ Apple Silicon
cask "discord"               # communities / gaming / dev servers
cask "whatsapp"              # messaging
cask "iina"                  # modern media player (mpv-backed); plays what QuickTime won't
{{- end }}
{{- end }}
